<details><summary>Digger run report at 2024-08-05 11:23:12 (UTC)</summary>
  <details><summary>Apply for <b>anzeha/floorball-fantasy-infra#staging_kubernetes-addons</b></summary>
  
```terraform
Terraform will perform the following actions:

  # kubernetes_namespace.example1 will be created
  + resource "kubernetes_namespace" "example1" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + annotations      = {
              + "name" = "example-annotation1"
            }
          + generation       = (known after apply)
          + labels           = {
              + "mylabel" = "label-value1"
            }
          + name             = "terraform-example-namespace1"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
kubernetes_namespace.example1: Creating...
kubernetes_namespace.example1: Creation complete after 1s [id=terraform-example-namespace1]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

  ```
</details>
</details>